In [1]:
import pandas as pd 
import numpy as np

In [3]:
# import csv file 
my_df = pd.read_csv('MOCK_DATA.csv')
my_df

  breed_name  average_height  average_weight  life_span origin_country
0    Fairfax            7.60          129.92         12         Russia
1     Carson           12.29          147.47          6          China
2   Matthieu           24.80           31.33          7         France
3       Bili           15.15          184.85         16         Greece
4      Myron           15.10          198.58         20         Russia
5       Troy           20.27           81.86          8         Russia
6       Boyd           28.19           21.32          7         Russia
7     Eimile           14.33           18.12         12           Peru
8      Briny            8.18          196.32          6          China
9      Kiley           29.59           95.02         12         Russia

In [4]:
# Grab first 5 rows 
my_df.head()

  breed_name  average_height  average_weight  life_span origin_country
0    Fairfax            7.60          129.92         12         Russia
1     Carson           12.29          147.47          6          China
2   Matthieu           24.80           31.33          7         France
3       Bili           15.15          184.85         16         Greece
4      Myron           15.10          198.58         20         Russia

In [5]:
# Grab certain number of first rows 
my_df.head(9)

  breed_name  average_height  average_weight  life_span origin_country
0    Fairfax            7.60          129.92         12         Russia
1     Carson           12.29          147.47          6          China
2   Matthieu           24.80           31.33          7         France
3       Bili           15.15          184.85         16         Greece
4      Myron           15.10          198.58         20         Russia
5       Troy           20.27           81.86          8         Russia
6       Boyd           28.19           21.32          7         Russia
7     Eimile           14.33           18.12         12           Peru
8      Briny            8.18          196.32          6          China

In [6]:
# Grab last 5 rows 
my_df.tail()

  breed_name  average_height  average_weight  life_span origin_country
5       Troy           20.27           81.86          8         Russia
6       Boyd           28.19           21.32          7         Russia
7     Eimile           14.33           18.12         12           Peru
8      Briny            8.18          196.32          6          China
9      Kiley           29.59           95.02         12         Russia

In [7]:
# Grab certain number of last rows 
my_df.tail(6)

  breed_name  average_height  average_weight  life_span origin_country
4      Myron           15.10          198.58         20         Russia
5       Troy           20.27           81.86          8         Russia
6       Boyd           28.19           21.32          7         Russia
7     Eimile           14.33           18.12         12           Peru
8      Briny            8.18          196.32          6          China
9      Kiley           29.59           95.02         12         Russia

In [8]:
# Get into about the dataframe
my_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   breed_name      10 non-null     object
 1   average_height  10 non-null     float64
 2   average_weight  10 non-null     float64
 3   life_span       10 non-null     int64
 4   origin_country  10 non-null     object
dtypes: float64(2), int64(1), object(2)
memory usage: 532.0+ bytes

In [9]:
# Get shape of rows and columns
my_df.shape

(10, 5)

In [10]:
# Get number of dimensions 
my_df.ndim

2

In [11]:
# Get the column datatypes 
my_df.dtypes

breed_name         object
average_height    float64
average_weight    float64
life_span           int64
origin_country     object
dtype: object

In [12]:
# Get some statistics about the data
my_df.describe()

       average_height  average_weight  life_span
count       10.000000        10.00000  10.000000
mean        17.550000       110.47900  10.600000
std          7.850902        71.65496   4.695151
min          7.600000        18.12000   6.000000
25%         12.800000        43.96250   7.000000
50%         15.125000       112.47000  10.000000
75%         23.667500       175.50500  12.000000
max         29.590000       198.58000  20.000000

In [13]:
# Describe a specific column 
my_df['breed_name'].describe()

count          10
unique         10
top       Fairfax
freq            1
Name: breed_name, dtype: object

In [14]:
# Describe a specific column 
my_df['origin_country'].describe()

count         10
unique         5
top       Russia
freq           5
Name: origin_country, dtype: object

In [15]:
# Describe a specific column 
my_df['life_span'].describe()

count    10.000000
mean     10.600000
std       4.695151
min       6.000000
25%       7.000000
50%      10.000000
75%      12.000000
max      20.000000
Name: life_span, dtype: float64

In [16]:
# Select specific column using brackets
my_df['breed_name']

0     Fairfax
1      Carson
2    Matthieu
3        Bili
4       Myron
5        Troy
6        Boyd
7      Eimile
8       Briny
9       Kiley
Name: breed_name, dtype: object

In [17]:
# Select specific column using Dot Notation -> same thing
my_df.breed_name

0     Fairfax
1      Carson
2    Matthieu
3        Bili
4       Myron
5        Troy
6        Boyd
7      Eimile
8       Briny
9       Kiley
Name: breed_name, dtype: object

In [21]:
# Select Specific column using Location
my_df.iloc[:, 3]

0    12
1     6
2     7
3    16
4    20
5     8
6     7
7    12
8     6
9    12
Name: life_span, dtype: int64